[
  {
    "id": 1,
    "title": "Senior Fullstack Engineer (Contractor)",
    "company": "PwC",
    "industry": "Professional Services",
    "period": {
      "en": "2023 - Current",
      "sr": "2023 - Тренутно"
    },
    "location": {
      "en": "Belgrade, Serbia",
      "sr": "Београд, Србија"
    },
    "description": {
      "en": "Lead Frontend Developer on a large-scale asset management platform migration, transitioning from a legacy system to a modern Angular-based application with enhanced functionality. Key contributor in a distributed, cross-functional team, driving feature development, UI/UX improvements, and integration with a microservice architecture on Azure. Applied best practices for scalability, maintainability, and performance, leveraging technologies including Angular, .NET 7, and micro frontends. Maintained direct communication with clients to align deliverables with business objectives and ensure seamless adoption of new features.",
      "sr": "Главни фронтенд програмер на пројекту велике миграције платформе за управљање имовином, прелазак са застарелог система на модерну апликацију засновану на Angular-у са проширеном функционалношћу. Кључни члан дистрибуираног, мултидисциплинарног тима, задужен за развој нових функционалности, унапређење UI/UX-а и интеграцију са микро-сервис архитектуром на Azure-у. Примењивао најбоље праксе за скалабилност, одрживост и перформансе, користећи технологије као што су Angular, .NET 7 и микро-фронтенди. Остваривао директну комуникацију са клијентима ради усклађивања испорука са пословним циљевима и обезбеђивања несметаног усвајања нових функционалности."
    },
    "technologies": [".NET 7", "Angular", "Azure", "Micro Frontends", "MS SQL", "RabbitMQ"]
  },
  {
    "id": 2,
    "title": "Senior .NET Engineer (Contractor)",
    "company": "Rokolabs",
    "industry": "Software Development",
    "period": {
      "en": "2022 - 2023",
      "sr": "2022 - 2023"
    },
    "location": {
      "en": "Belgrade, Serbia",
      "sr": "Београд, Србија"
    },
    "description": {
      "en": "Software Developer on a real estate asset management platform, enabling clients to manage properties, track building components such as floors and sensors, and monitor maintenance needs in real time. Contributed to the design and implementation of a microservice architecture using Docker and AWS, following modern best practices for scalability and reliability. Worked extensively with .NET 6 and .NET 7 to build high-performance backend services. Collaborated closely with a distributed, cross-functional team and maintained direct client communication to ensure alignment between technical deliverables and operational requirements.",
      "sr": "Софтверски програмер на платформи за управљање непокретностима, омогућавајући клијентима да управљају објектима, прате компоненте зграда као што су спратови и сензори, као и да у реалном времену прате потребе за одржавањем. Доприносио дизајну и имплементацији микро-сервис архитектуре користећи Docker и AWS, пратећи савремене најбоље праксе за скалабилност и поузданост. Интензивно радио са .NET 6 и .NET 7 на развоју високо-перформантних бекенд сервиса. Сарађивао блиско са дистрибуираним, мултидисциплинарним тимом и одржавао директну комуникацију са клијентима како би се осигурало усклађивање техничких испорука са оперативним захтевима."
    },
    "technologies": [".NET 6", ".NET 7", "Docker", "AWS", "RabbitMQ", "gRPC", "Redis", "PostgreSQL", "Elasticsearch", "GraphQL"]
  },
  {
    "id": 3,
    "title": "Senior .NET Engineer",
    "company": "Interventure",
    "industry": "Healthcare Technology",
    "period": {
      "en": "2022 - 2022",
      "sr": "2022 - 2022"
    },
    "location": {
      "en": "Belgrade, Serbia",
      "sr": "Београд, Србија"
    },
    "description": {
      "en": "Worked as part of a distributed team assigned to one of the largest dental support organizations in the United States. Contributed to the development and maintenance of an Enterprise Practice Management System (EPMS) used by over 25,000 patients across more than 900 locations.",
      "sr": "Радио као део дистрибуираног тима додељеног једној од највећих организација за подршку стоматолошких ординација у Сједињеним Државама. Допринео развоју и одржавању Enterprise Practice Management System (EPMS) који користи преко 25,000 пацијената у више од 900 локација."
    },
    "technologies": [".NET", "Microservices", "Enterprise Systems", "Legacy Code Refactoring"]
  },
  {
    "id": 4,
    "title": "Team Lead/Tech Lead",
    "company": "Clarivate",
    "industry": "Information Services",
    "period": {
      "en": "2020 - 2022",
      "sr": "2020 - 2022"
    },
    "location": {
      "en": "Belgrade, Serbia",
      "sr": "Београд, Србија"
    },
    "description": {
      "en": "Led a team of 6–8 engineers while collaborating closely with external teams on a large-scale project. Responsible for designing and implementing microservice architecture from scratch on Azure, applying Domain-Driven Design (DDD) principles.",
      "sr": "Водио тим од 6–8 инжењера док је блиско сарађивао са спољним тимовима на великом пројекту. Одговоран за дизајнирање и имплементацију микросервисне архитектуре од почетка на Azure-у, примењујући принципе Domain-Driven Design (DDD)."
    },
    "technologies": ["Azure", "DDD", "Azure Service Bus", "Azure Functions", "WebJobs", "MongoDB", "SignalR"]
  },
  {
    "id": 5,
    "title": "Senior .NET Engineer (Contractor)",
    "company": "RareCrew",
    "industry": "Software Development",
    "period": {
      "en": "2019 - 2020",
      "sr": "2019 - 2020"
    },
    "location": {
      "en": "Belgrade, Serbia",
      "sr": "Београд, Србија"
    },
    "description": {
      "en": "Participated in building a greenfield project from scratch using .NET Core 3.0 on the backend and Angular 8 on the frontend. Followed best practices for frontend architecture, with a strong focus on scalable state management using NgRx.",
      "sr": "Учествовао у изградњи greenfield пројекта од почетка користећи .NET Core 3.0 на backend-у и Angular 8 на frontend-у. Пратио најбоље праксе за frontend архитектуру, са јаким фокусом на скалабилно управљање стањем помоћу NgRx."
    },
    "technologies": [".NET Core 3.0", "Angular 8", "NgRx", "Frontend Architecture"]
  }
]